# The pd.concat Method, part 1

In [1]:
import pandas as pd

In [3]:
week_1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week_2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [4]:
week_1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [5]:
week_2.head(3)

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10

In [6]:
pd.concat([week_1, week_2])

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[500 rows x 2 columns]

In [7]:
pd.concat(objs=[week_1,week_2])

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[500 rows x 2 columns]

In [8]:
pd.concat(objs=[week_1,week_2],ignore_index=False)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[500 rows x 2 columns]

In [9]:
pd.concat(objs=[week_1,week_2],ignore_index=True)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

In [12]:
# method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
week_1.append(week_2)

C:\Users\Tom\AppData\Local\Temp\ipykernel_21572\2147425015.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  week_1.append(week_2)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[500 rows x 2 columns]